app/Helpers/helper.php

    function refNumberExists($refType, $number) {
        // query the database and return a boolean
        // for instance, it might look like this in Laravel
        if($refType === 'payment'){
            return Payment::where('payment_ref_no',$number)->exists();
        }
        elseif($refType === 'appointment'){
            return Appointment::where('ref',$number)->exists();
---
select exists(select * from `payments` where `payment_ref_no` = 3547306588) as `exists`
select exists(select * from `appointments` where `ref` = 5837642613) as `exists`

    function createAppointmentAndPaymentOrder($statusType, $paymentType)
    {
        $newCustomer = session()->get('newcustomer');
        $newCustomer['details'] = app(AppointmentService::class)->prepareAppointmentDetails($newCustomer);
        $newCustomer['amount'] = isset($newCustomer['quantity']) ? ($newCustomer['quantity'] * $newCustomer['amount']) + $newCustomer['pvc_print_delivery_cost'] : $newCustomer['amount'] + $newCustomer['pvc_print_delivery_cost'];
        $newCustomer['delivery_cost'] = $newCustomer['pvc_print_delivery_cost'];
        unset(
            $newCustomer['pvc_print_delivery_cost'],
            $newCustomer['payment_method'],
            $newCustomer['name'],
            $newCustomer['description'],
            $newCustomer['quantity'],
            $newCustomer['total_amount'],
            $newCustomer['slug'],
            $newCustomer['birth_location'],
            $newCustomer['applying_for'],
            $newCustomer['children_count'],
            $newCustomer['company_name'],
            $newCustomer['time'],
            $newCustomer['is_booking_appointment'],
        );
        if($statusType === 'failed'){
            $newCustomer['status'] = Appointment::PAYMENT_FAILED;
        }
        if($statusType === 'awaiting'){
            $newCustomer['status'] = Appointment::TOPAYONCAPTURE;
        }
        $appointment = Appointment::create($newCustomer);
---
insert into `appointments` (`ref`, `user_name`, `user_email`, `user_phone`, `location_id`, `card_type`, `date`, `start_time`, `end_time`, `duration`, `amount`, `our_service_id`, `service_type_id`, `delivery_address`, `postal_code`, `delivery_cost`, `status`, `updated_at`, `created_at`) values (5837642613, 'zazizugil', 'bodypal4me@gmail.com', '+1 (333) 818-1965', '1', 'Print Out', '2025-09-24 13:45:00', '13:45:00', '14:00:00', 15, 110, '1', 1, null, null, 15, 5, '2025-09-24 09:42:46', '2025-09-24 09:42:46')

                else{
                    $data['payment_status'] = Payment::PAYMENTSTATUS['awaiting'];
                }
                Payment::create($data);
---
insert into `payments` (`payment_ref_no`, `amount_paid`, `payment_gateway`, `appointment_id`, `payment_status`, `updated_at`, `created_at`) values (3547306588, 110, 'Offline', 6312, 4, '2025-09-24 09:42:46', '2025-09-24 09:42:46')