app/Http/Controllers/BookingController.php

select * from `locations` where `status` = 1
select * from `service_types`
---
    public function create(Request $request)
    {
        $requestedServiceType = null;
        if($request->has('serviceType') && !empty($request->serviceType)){
            $requestedServiceType = ServiceType::where('slug', $request->serviceType)->first();
            if(!isset($requestedServiceType)){
                return redirect()->back()->with('error', 'Service type not found, please select a valid service type to proceed');
            }
        }

        $locations = Location::where('status', Location::LOCATION_STATUS_ACTIVE)->get();
        $serviceTypes = ServiceType::get();

select * from `our_services` where `id` = '1' limit 1
---
    public function store(StoreBookingRequest $request)
    {   //dd($request->all());
        $durationPerAppointment = config('settings.duration_per_appointment'.$request->location_id);
        $bookedDateAndTime = Carbon::createFromTimestamp(strtotime($request->date . $request->time));
        session()->forget('newcustomer');
        $data = [];
        $data['ref'] = generateRefNumber('appointment');//random_int(100000, 99999999);
        $data['user_name'] = $request->user_name;
        $data['user_email'] = $request->user_email;
        $data['user_phone'] = $request->user_phone;
        $data['location_id'] = $request->location_id;
        $data['card_type'] = $request->card_type;
        $data['date'] =  $bookedDateAndTime;
        $data['start_time'] = $bookedDateAndTime->toTimeString();
        $data['end_time'] = $bookedDateAndTime->copy()->addMinutes($durationPerAppointment)->toTimeString();
        $data['duration'] = $durationPerAppointment;
        $data['amount'] = config('settings.nin_capture_price'.$request->location_id);
        $data['pvc_print_delivery_cost'] = $request->card_type == Appointment::CARD_TYPE_PVC ? config('settings.pvc_print_delivery_cost'.$request->location_id) : 0;
        $ourService = OurService::where('id', $request->our_service_id)->first();

select count(*) as aggregate from `appointments` where `date` = '2025-09-24 13:45:00'
select `name`, `slug` from `service_types` where `id` = 1 limit 1
---
    public function show(Appointment $appointment)
    {
        $newCustomer = session()->get('newcustomer');
        if(!isset($newCustomer)){
            return redirect()->route('bookings.create')->with('error', "Please, fill your details and submit to book for NIN capture");
        }
        $numberOfAccessPoints = config('settings.no_of_access_points_per_duration'.$newCustomer['location_id']);
        $appointmentCount = Appointment::where('date',$newCustomer['date'])->count();
        if($appointmentCount >=  $numberOfAccessPoints){
            return back()->withInput($newCustomer)->with('error' ,'Appointment time '. Carbon::parse($newCustomer['start_time'])->format('h:i A') .' on '. Carbon::parse($newCustomer['date'])->format('M d, Y') .' has been fully booked and not available');
        }
        $serviceType = ServiceType::select('name', 'slug')->where('id', $newCustomer['service_type_id'])->first();

select * from `appointments` where `ref` = 6321190183 limit 1
---
    public function displayBookedInformation($refno)
    {
        $appointment = Appointment::where('ref', (int)$refno)->first();

select exists(select * from `appointments` where `ref` = 5837642613) as `exists`
---
    public function processManualBooking(Request $request)
    {
        $newCustomer = session()->get('newcustomer');
        if(!isset($newCustomer )){
            return redirect()->route('bookings.create')->with('error', 'Your appointment has been created, check your email.');
        }
        if(Appointment::where('ref', $newCustomer['ref'])->exists()){

select * from `appointments` where date(`date`) = '2025-09-24' and `location_id` = '1'
select count(*) as aggregate from `appointments` where `date` = '2025-09-24 10:00:00' and `status` <> 4
---
    public function getUnavailableTime($request)
    {
        $numberOfAccessPoints = config('settings.no_of_access_points_per_duration'.$request->location_id);
        $date = Carbon::parse($request->date);
        $bookedTimeArray = [];
        $allAppointmentsWithinDates = Appointment::whereDate('date','=', $date)->where('location_id', $request->location_id)->get();
        foreach( $allAppointmentsWithinDates as  $allAppointmentsWithinDate)
        {
             $appointment = Appointment::where('date',$allAppointmentsWithinDate->date)->where('status', '<>', Appointment::CANCELLED);
             $totalBookedInThisTime = $appointment->count();

select `nin_capture_price`, `pvc_print_delivery_cost` from `general_settings` where `location_id` = '1' limit 1
select `service_types`.`id`, `service_types`.`name` from `service_types` left join `our_services` on `our_services`.`service_type_id` = `service_types`.`id` where `our_services`.`location_id` = '1' and `our_services`.`allow_online_payment` = 0 and `our_services`.`status` = 1 group by `service_types`.`name`, `service_types`.`id`
---
    public function geAvailableTimeSlots(Request $request){

        $setting = GeneralSetting::where('location_id', $request->location_id)->first(['nin_capture_price', 'pvc_print_delivery_cost'])->toArray();
        $openingDuration = $this->openingDuration( $request);
        $data = [];
        $today =  Carbon::now()->format('d F, Y');

        $service_type = ServiceType::select('service_types.id', 'service_types.name')
        ->leftJoin('our_services','our_services.service_type_id', '=' ,'service_types.id')
        ->where('our_services.location_id', $request->location_id)
        ->where('our_services.allow_online_payment',false)
        ->where('our_services.status', true)->groupBy('service_types.name', 'service_types.id')->get();

select * from `closed_durations` where date(`date_from`) <= '2025-09-24' and date(`date_to`) >= '2025-09-24' and `location_id` = 1 and `status` = 1 order by `created_at` desc limit 1
---
    public function getClosedDurationTime($date, int $location_id)
    {
        $date = date('Y-m-d', strtotime($date));
        $closedDuration = ClosedDuration::WhereDate('date_from', '<=', $date)->whereDate('date_to', '>=', $date)
            ->where('location_id', $location_id)->where('status', true)->latest()->first();

select `our_services`.`id`, `service_types`.`name` from `service_types` left join `our_services` on `our_services`.`service_type_id` = `service_types`.`id` where `our_services`.`location_id` = '1' and `our_services`.`allow_online_payment` = 0 and `our_services`.`status` = 1 group by `service_types`.`name`, `our_services`.`id`
---
    public function getAvailableService(Request $request){

        $service_type = ServiceType::select('our_services.id', 'service_types.name')
        ->leftJoin('our_services','our_services.service_type_id', '=' ,'service_types.id')
        ->where('our_services.location_id', $request->location_id)
        ->where('our_services.allow_online_payment',false)
        ->where('our_services.status', true)->groupBy('service_types.name', 'our_services.id')->get();

select * from `our_services` where `id` = '1' limit 1
select * from `service_types`
---
    public function getSingleService(Request $request){

        $ourService = OurService::where('id', $request->service_id)->first();
        $slug = $ourService->serviceType->slug;
        $ourService = $ourService->toArray();
        $service_type = ServiceType::get();