app/Http/Controllers/FrontController.php

    public function bvn(){

        $locations = Location::where('status', Location::LOCATION_STATUS_ACTIVE)->get();
---
select * from `locations` where `status` = 1

    public function certificateOptions(){
        $notificationBirthCertificate =  ServiceType::where('slug', ServiceType::NPC_NOTIFICATION_BIRTH_CERTIFICATE)->with('ourService')->first() ?? null;
        $attestationBirthCertificate =  ServiceType::where('slug', ServiceType::NPC_ATTESTATION_BIRTH_CERTIFICATE)->with('ourService')->first() ?? null;
---
select * from `our_services` where `our_services`.`service_type_id` in (8)
select * from `service_types` where `slug` = 'npc-notification-birth-certificate' limit 1
select * from `our_services` where `our_services`.`service_type_id` in (10)
select * from `service_types` where `slug` = 'npc-attestation-birth-certificate' limit 1